#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/renata-corporation/learning-aws-lambda-with-serverless/runs/run-2DGBYSR7wRFREj4y

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
aws_dynamodb_table.productsdb: Refreshing state... [id=Products]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.basketdb will be created
  + resource "aws_dynamodb_table" "basketdb" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "userName"
      + id               = (known after apply)
      + name             = "Baskets"
      + read_capacity    = 20
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "dynamodb-table-baskets"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "dynamodb-table-baskets"
        }
      + write_capacity   = 20

      + attribute {
          + name = "userName"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @renatabrasil, Action: `pull_request`*